---
kind: method
id: M:Autodesk.Revit.DB.Analysis.EnergyDataSettings.CheckRangeOfSillHeight(System.Double)
source: html/484a4c0b-fa66-4049-af95-b6573aa0c78a.htm
---
# Autodesk.Revit.DB.Analysis.EnergyDataSettings.CheckRangeOfSillHeight Method

Checks that the sill height is greater than or equal to zero.

## Syntax (C#)
```csharp
public static bool CheckRangeOfSillHeight(
	double sillHeight
)
```

## Parameters
- **sillHeight** (`System.Double`) - The sill height to be checked.

## Returns
True if the sill height falls is greater than or equal to zero, false otherwise.